#pragma once
char prolog[27][300] = {
	"20XX년 12월 5일. 한 남성이 불면증 치료를 요청하며 찾아왔다.^(문장 마침 표시(ː)가 뜨면 스페이스 바를 눌러 대화를 넘길 수 있습니다.) ː",
	"환자의 상태를 파악하기 위해 간단한 설문과 질의응답을 진행하였고, 그를 통해 파악한 환자의 상태는 다음과 같았다. ː",
	"1. 환자의 직업은 경찰이며, 최근 한 달간 담당 구역의 사건, 사고가 끊이질 않아 많은 업무를 처리해야 했다. ː",
	"2. 때문에 심신 과로에 따른 신경쇠약 증세가 나타났고, 그에 따라 신경과민 증세가 나타났다. ː",
	"3. 신경과민으로 인해 피로가 쉽게 누적되었으나, 잠에 잘 들지 못하고, 겨우 잠에 들더라도 악몽을 꾸고 깨어나 피로가 해소되지 않는다. ː",
	"이에 환자의 병을 과로로 인한 신경쇠약 및 불면증이라 진단하고, 주기적인 상담 권유와 함께 증상을 완화시켜줄 약을 처방해주었다. ː",
	"첫 방문 이후 며칠 간은 상담과 약 복용을 통해 증상이 점차 완화되었지만,^문제는 그 이후였다. ː",
	"“약 덕분에 잠에 드는 것은 어렵지 않지만, 매번 악몽을 꾸고 소스라치듯 놀라며 깨어납니다. 그렇게 깬 이후로는 다시 잠들지도 못하고요. 이젠 어떡해야 하는 걸까요?”ː",
	"피로와 우울에 짓눌린 목소리로 환자가 도움을 요청해왔다. ː",
	"“환자분이 꾸는 악몽이 심리적인 문제와 연관되어 있다면 상담을 통한 치료를 권해드리겠지만, 그런 이유가 아니라면 근본적인 해결책을 내어드리기는 힘들 것 같군요. 매번 똑같은 악몽을 꾸는 건가요?”ː",
	"“……그런 것 같습니다.”ː",
	"“꿈의 내용은 기억하지 못하시는 건가요?”ː",
	"“내용은 기억하지 못하지만, 깨어날 때의 제 상태는 알고 있습니다. 제가 기억하는 것은 온몸이 경직되어 몇 분간 움직이지 못한다는 것인데, 동생 녀석은 제가 절규에 가까운 비명을 지르며 깨어난다고 하더군요.”ː",
	"“지금까지의 상담 내역만 봤을 때는 심적 피로도가 높아서라고 생각되지만…… 혹시 저와 상담한 것 외에 특별한 일이 있으셨나요?”ː",
	"내 물음에 난처한 듯한 표정을 짓던 환자는 조심스레 입을 열었다. ː",
	"“사실 딱 2주 전에 실신을 한 적이 있습니다. 쌓여있던 스트레스와 피로가 터지면서 쓰러진 것 같은데, 하필이면 쓰러지면서 머리가 좋지 않은 곳에 부딪혔는지 역행성 기억상실 진단도 받았고요.”ː",
	"“역행성 기억상실……. 생각지도 못한 특별한 일이네요.”ː",
	"“하하, 실신한 것도 웃긴데 잘못 쓰러져서 기억상실이라고 하면 더 웃기지 않습니까. 크게 아픈 곳은 없어서 영양보급 수액만 맞고 퇴원한데다, 기억은 때가 되면 돌아올 거라고 하고, 일상생활이나 업무에 지장이 있는 것도 아니었으니까요.”ː",
	"“음……, 그 잊어버린 기억이 악몽과 관련이 있을 가능성은 없을까요?”ː",
	"“글쎄요……. 아, 생각해보니 악몽을 꾸기 시작한 것도 2주 전…….^이렇게 말하고 나니까 매우 연관성이 있어 보이는군요. 이런 상황이어도 정신과 치료로 괜찮아질 방법이 있나요?”ː", //20
	"환자의 물음에 나는 자연스럽게 기억이 돌아올 때까지 기다려보거나, 최면 치료를 받아보는 방법이 있다고 대답했다. ː",
	"환자는 고민 끝에 최면 치료를 받아보고 싶다고 말했고, 나는 최면에 대해 설명해주며 환자에게 편안한 의자에 앉을 것을 권했다. ː",
	"모든 사전 준비를 마치고 난 후, 눈을 감고 있는 환자에게 고요한 목소리로 말을 걸며 최면을 유도하기 시작한다. ː",
	"“눈에 힘을 빼고 눈꺼풀이 점점 무거워지는 것을 느껴보세요.”ː",
	"“당신은 점점 편안하고 평화로운 상태로 들어갑니다.”ː",
	"“몸이 나른해지는 것을 느낍니다. 제 이야기를 들을수록 점점 편안한 느낌이 강해지면서 평화로운 휴식 상태에 빠집니다.”ː",
	"……………… ː"
};

char epilog[17][60] =
{
	"soRRow",
	"woRRos: 걱정하는 사람",
	"제작: 2K2S Team",
	"기획: 2K2S Team",
	"프리 프로덕션: 김경남",
	"맵 그래픽 디자인: 손서영",
	"시나리오: 김예진",
	"게임 레벨 디자인: 손서영",
	"게임 이벤트 디자인 및 구현: 손혜원",
	"미니게임 디자인 및 구현: 김경남",
	"게임 콘솔 기능 담당: 김예진, 손혜원",
	"아이템 디자인 및 구현: 김예진",
	"게임 사운드 디자인: 손서영",
	"게임 버그 수정: 김경남, 김예진, 손혜원",
	"메세지창 구현: 김예진, 김경남",
	"Special thanks to 최준연 교수님",
	"Copyright 2K2S Team 2018 All Rights Reserved"
};

char Hallway[10][300] = {
	"문이 잠겨있어 들어갈 수 없다.",
	"1번방 열쇠로 잠겨있는 1번방의 문을 열었다. ː",
	"2번방 열쇠로 잠겨있는 2번방의 문을 열었다. ː",
	"경찰 ID 카드로 잠겨있는 3번방의 문을 열었다. ː",
	"극장 티켓으로 잠겨있는 4번방의 문을 열었다. ː",
	"5번방 탈출 열쇠로 잠긴 5번방의 문을 열었다. ː",
	"6번방 열쇠로 잠겨있는 6번방의 문을 열었다. ː",
	"핏자국이 2번방으로 이어져 있다. 1번방에서 총성을 들었을 때 생긴 흔적인 듯하다. ː"
};

char ZeroRoomMessage[14][300] = {
	"“환자분, 제 말 들리시나요?”ː",
	"“지금 보이는 곳은 환자분의 무의식이 형상화된 공간이며, 이곳에서 환자분이 얼마나 깊은 최면에 빠져있는지 확인하고, 제 말에 대한 반응을 시험해보려 합니다.”ː",
	"“우선 가볍게 움직여 보시겠어요?”^(플레이어(▲)를 상(W), 하(S), 좌(A), 우(D)로 움직여 보세요.) ː",
	"“좋습니다. 그럼 이번엔 좌측 상단에 있는 금고 열쇠(♀)를 주워 볼까요?”^(플레이어를 아이템 근처로 움직인 후 스페이스 바를 누르면 아이템을 획득할 수 있습니다. 가지고 있는 아이템은 Item List에 표시됩니다.) ː",
	"금고 열쇠를 획득했다. ː", //5 인덱스는 4
	"“금고 열쇠는 방 중앙에 있는 금고(▣)에서 사용할 수 있습니다.”^(플레이어를 아이템 근처로 움직인 후 스페이스 바를 누르면 아이템을 사용할 수 있습니다. 사용한 아이템은 Item List에서 사라집니다.) ː",
	// 금고
	"자물쇠로 잠겨있는 금고가 놓여있다. ː",
	"빈 금고가 놓여있다. ː", //8 인덱스는 7
	"금고 열쇠를 사용해 금고를 열었다. ː",
	"금고 안에 들어있던 1번방 열쇠를 획득했다.",
	"“위에 보이는 출구로 나가시면 복도가 보일 겁니다. 복도를 통해 여러 방으로 들어갈 수 있고요.”ː", //10 인덱스는 9
	"“방마다 번호가 있으며, 방에 들어가기 위해서는 해당 방의 열쇠가 필요합니다. 방금 얻은 1번방 열쇠로 1번방을 들어가 볼 수 있겠군요.”ː",
	"“이 공간을 돌아다니면서 여러 단서들을 모으다 보면 잃어버린 기억에 대한 단서를 얻으실 수 있을 겁니다.”ː",
	"“그럼, 환자분이 이 공간을 어느 정도 돌아본 후에 다시 뵙죠.”ː"
};

char FirstRoomMessage[30][300] = {
	//메모장
	"눌러 쓴 흔적이 남은 메모장을 획득했다. ː",
	//연필
	"연필을 획득했다. ː",
	//숫자가 적힌 쪽지
	"메모장의 흔적 위를 연필로 칠하자 숫자가 나타났다. ː",
	"숫자가 적힌 종이가 생성되었다. ː",
	//찢어진 티켓조각(1/3)
	"찢어진 티켓조각을 획득했다. ː", //5 인덱스 4
	//책상
	"깔끔히 정리된 책상 밑 서랍에 비밀번호 네 자리를 입력할 수 있는 번호키가 달려 있다.^비밀번호에 대한 단서를 찾아보자. ː", // 숫자적힌쪽지 생성 전 5
	// 숫자적힌쪽지 생성 후는 함수 안에
	"깔끔히 정리된 책상이 있다. 여기서 더 얻을 수 있는 단서는 없는 것 같다. ː", // 2번방 열쇠 획득 후 6
	//컴퓨터
	"전원이 꺼져 있는 컴퓨터가 있다. ː", //인덱스 7
	"전원을 연결할 장치는 보이지 않는다. ː", //인덱스 8
	//소파(의자)
	"안락한 소파가 있다. ː", //인덱스 9
	//침대 - 신문
	"어질러진 침대 위에 신문이 놓여있다. ː", //10
	"20XX년 11월 XX일^＊＊교도소에 수감 중이었던 연쇄 살인마가 탈옥 후 도주 중이라는 소식에 온 국민이 공포에 떨고 있다. ː", //11
	"이에 경찰은 총력을 다해 탈옥범을 찾고 있다고 답했으며, 범인이 검거될 때까지 늦은 시간의 통행이나 홀로 인적 드문 거리를 걷는 일은 지양해달라고 요청했다. ː", //12
	//침대 - 베개
	"푹신해 보이는 베개가 놓여있다. 손을 대보니 따스한 온기가 느껴진다. ː", // 13
	//책상에서 정답 맞췄을 때
	"알맞은 답을 입력하여 책상 서랍이 열렸다. ː", //인덱스 14
	"책상 서랍에서 2번방 열쇠를 획득했다. ː",
	//책상에서 정답 맞추지 못했을 때
	"아무 일도 일어나지 않는다. 답이 틀린 것 같다. ː", //인덱스 16
	//총성
	"방 밖에서 총성이 들려왔다. ː" //17
};

char SecondRoomMessage[30][300] = {
	//청진기
	"의사가 청진기로 환자의 상태를 확인하고 있다. ː",
	//링거
	"링거를 맞고 있는 환자가 잠들어있다. ː",
	//주사기
	"간호사가 환자에게 주사를 놓고 있다. ː",
	//찢어진 티켓조각(2/3)
	"찢어진 티켓조각을 획득했다. ː",
	//경찰ID카드
	"경찰 ID 카드를 획득했다. ː", //4
	"앞면에는 내 이름이, 뒷면에는‘Room 3’라는 단어가 적혀있다. ː",
	//진료차트
	"환자들의 진료 차트를 모아둔 클립보드가 놓여있다. ː", //6
	"자세히 살펴보니 환자들의 진료 기록은 모두 총에 의한 외상이라고 적혀있다. ː",
	"정보를 더 얻기 위해 서류를 넘겼으나 별다른 기록은 남아있지 않고, 퀴즈가 프린트된 종이만 눈에 들어온다. ː" ,
	"이미 문제를 풀었다. 여기서 더 얻을 수 있는 단서는 없는 것 같다. ː", //9
	"알맞은 답을 입력하여 경찰 ID 카드가 나타났다. ː", //10
	"아무 일도 일어나지 않는다. 답이 틀린 것 같다. ː"
 };

char ThirdRoomMessage[30][300] = {
	//사건파일
	"사건 파일을 획득했다. ː",
	"20XX년 11월 XX일^XX구 극장에서 총기 난사 사건^범인 수사 중. ː",
	"20XX년 11월 XX일^XX구에서 보복 살인 사건^9월에 구금된 연쇄 살인범이 탈옥 후 또 다시 범행을 저지른 것을 확인. 새로운 수배지 배포. ː",
	"20XX년 7월 15일^7월부터 이어진 다섯 건의 연쇄 살인 사건^범인 검거(9월 28일). ː",
	//수갑
	"범인 체포를 위한 수갑을 획득했다. ː", //4
	//티켓조각
	"마지막 사건 파일에서 찢어진 티켓조각을 획득했다. ː", //5
	"찢어진 티켓조각을 모두 모아 극장 티켓을 획득했다. ː", "극장 티켓에는 큰 글씨로‘XX구 극장’이 쓰여있고, 바로 밑에‘Room 4’라는 단어가 적혀있다. ː"
};

char SixthRoomMessage[30][300] = {
	//전기 레버
	"전기 레버가 달려 있다. ː", "손잡이를 잡아당기자 어디선가 작게 딸칵 소리가 났다. ː", "더는 움직이지 않는다. ː",
	//전화기
	"휴대 전화가 놓여 있다. ː",//3
	"휴대 전화를 살펴보다가‘11월 XX일’이라고 저장되어 있는 음성 파일을 발견했다. 그날의 전화 기록을 녹음해 둔 파일 같다. ː",//4
	"첫 번째 녹음^“선배, 어디쯤이세요? 저는 지금 현장으로 가고 있어요. 그러게요. 총기난사사건이라니……. 선배님도 조심하세요. 요즘 들어 유독 보복 범죄도 잦잖아요. 네, 네. 그럼 이따 뵙겠습니다!”ː",
	"두 번째 녹음^“야, 들었냐?! 그 미친놈이 탈옥했대! 그래! 네가 몇 개월 전에 잡아 넣은 연쇄 살인마! 너 지금 어디냐? 현장 가는 중이라고? 조심해라. 당하는 건 한 순간이다.”ː",
	"세 번째 녹음^“오빠? 벌써 사건 마무리됐어? 아니라고? 그럼 왜? 나 괜찮냐고……? 아, 오빠도 들었구나, 탈옥범. 괜찮아~ 집 밖에 나갈 일도 없고. 오빠 올 때까지 집에 꼭 붙어 있을게. 걱정 말고 일 얼른 끝내고 와요. 응응, 나도 사랑해~”ː",
	"네 번째 녹음^“고객이 전화를 받지 않아 삐 소리 후 음성사서함으로 연결되며…….”ː",
	"소리가 뚝 끊겼다. 음성 파일의 재생이 완료된 것 같다. ː"
};

//“”
// ː
//…